Revit 2027 API
BuiltInFailures.StairRampFailures.ArcRunWidthTooLongFailure Property
 Arc run width is too long.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArcRunWidthTooLongFailure { get; }
Public Shared ReadOnly Property ArcRunWidthTooLongFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArcRunWidthTooLongFailure {
	FailureDefinitionId^ get ();
}
static member ArcRunWidthTooLongFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace